backend/app/models/book.rb

  def available_copies
    total_copies - borrowings.active.count
---
SELECT COUNT(*) FROM "books"