backend/app/serializers/borrowing_serializer.rb

  def serializable_hash
    {
      id: @borrowing.id,
      book: BookSerializer.new(@borrowing.book).serializable_hash,
      user: {
        id: @borrowing.user_id,
        email: @borrowing.user.email,
        first_name: @borrowing.user.first_name,
        last_name: @borrowing.user.last_name
---
SELECT "users".* FROM "users" WHERE "users"."id" = 185 LIMIT 1