backend/app/controllers/api/v1/books_controller.rb

SELECT "books".* FROM "books"
---
        scope = Book.all

SELECT "books".* FROM "books" WHERE (title ILIKE '%t%' OR author ILIKE '%t%' OR genre ILIKE '%t%') LIMIT 10 OFFSET 0
---
          scope = scope.where("title ILIKE ? OR author ILIKE ? OR genre ILIKE ?", query, query, query)
        end
        pagy, books = pagy(scope, limit: per_page_param)
        render json: {
          status: { code: 200, message: "Books retrieved successfully." },
          data: books.map { |book| BookSerializer.new(book).serializable_hash },
          pagination: pagination_meta(pagy)

INSERT INTO "books" ("author", "created_at", "genre", "isbn", "title", "total_copies", "updated_at") VALUES ('test', '2026-04-12 20:47:15.818366', 'Science Fiction', '978-0061120085', 'test', 1, '2026-04-12 20:47:15.818366') RETURNING "id"
---
      def create
        authorize Book
        book = Book.new(book_params)

        if book.save

UPDATE "books" SET "total_copies" = 5, "updated_at" = '2026-04-12 20:46:41.910019' WHERE "books"."id" = 121
---
      def update
        authorize @book

        if @book.update(book_params)

SELECT "borrowings".* FROM "borrowings" WHERE "borrowings"."book_id" = $1  [["book_id", 26]]
DELETE FROM "books" WHERE "books"."id" = $1  [["id", 26]]
---
      def destroy
        authorize @book

        if @book.borrowings.active.any?
          render json: {
            status: { code: 422, message: "Cannot delete a book with active borrowings." }
          }, status: :unprocessable_entity
          return
        end

        @book.destroy