backend/app/controllers/api/v1/borrowings_controller.rb

SELECT "books".* FROM "books" WHERE "books"."id" IN (121, 128, 126, 129, 123, 124, 127, 122, 125, 130)
SELECT "users".* FROM "users" WHERE "users"."id" IN (185, 186)
SELECT "borrowings".* FROM "borrowings" LIMIT 10 OFFSET 0
---
        scope = policy_scope(Borrowing).includes(:book, :user)
        pagy, borrowings = pagy(scope, limit: per_page_param)

        render json: {
          status: { code: 200, message: "Borrowings retrieved successfully." },
          data: borrowings.map { |b| BorrowingSerializer.new(b).serializable_hash },
          pagination: pagination_meta(pagy)

INSERT INTO "borrowings" ("book_id", "borrowed_at", "created_at", "due_date", "returned_at", "updated_at", "user_id") VALUES (129, '2026-04-12 20:40:10.656842', '2026-04-12 20:40:10.672465', '2026-04-26', NULL, '2026-04-12 20:40:10.672465', 185) RETURNING "id"
---
      def create
        authorize Borrowing
        borrowing = current_user.borrowings.new(
          book_id: borrowing_params[:book_id],
          borrowed_at: Time.current
        )

        if borrowing.save

UPDATE "borrowings" SET "returned_at" = '2026-04-12 20:45:59.102202', "updated_at" = '2026-04-12 20:45:59.105093' WHERE "borrowings"."id" = 72
---
      def return
        authorize @borrowing, :return_book?

        if @borrowing.returned_at.present?
          render json: {
            status: { code: 422, message: "This book has already been returned." }
          }, status: :unprocessable_entity
          return
        end

        if @borrowing.update(returned_at: Time.current)

SELECT "borrowings".* FROM "borrowings" WHERE "borrowings"."id" = 72 LIMIT 1
---
      def set_borrowing
        @borrowing = Borrowing.find(params[:id])