backend/app/controllers/api/v1/dashboard_controller.rb

SELECT "books".* FROM "books" WHERE "books"."id" IN (128, 126, 129, 124, 127, 122, 125, 130, 121, 123)
SELECT "users".* FROM "users" WHERE "users"."id" IN (185, 186)
SELECT COUNT(*) AS "count_all", "books"."id" AS "books_id" FROM "books" LEFT OUTER JOIN "borrowings" ON "borrowings"."book_id" = "books"."id" GROUP BY "books"."id" HAVING (books.total_copies - COUNT(borrowings.id) FILTER (WHERE borrowings.returned_at IS NULL) > 0)
SELECT "books".* FROM "books" WHERE "books"."id" = 124
SELECT "users".* FROM "users" WHERE "users"."id" = 186
---
      def render_librarian_dashboard
        render json: {
          status: { code: 200, message: "Librarian dashboard retrieved successfully." },
          data: {
            total_books: Book.count,
            total_borrowings: Borrowing.count,
            active_borrowings: Borrowing.active.count,
            overdue_borrowings: Borrowing.overdue.count,
            due_today: Borrowing.due_today.count,
            books_available: Book.left_joins(:borrowings).group(:id)
              .having("books.total_copies - COUNT(borrowings.id) FILTER (WHERE borrowings.returned_at IS NULL) > 0")
              .count.size,
            overdue_members: Borrowing.overdue.includes(:user, :book).map { |b|
              {
                member_name: "#{b.user.first_name} #{b.user.last_name}",
                book_title: b.book.title,
                due_date: b.due_date

SELECT "books".* FROM "books" WHERE "books"."id" IN (1, 8, 3, 7)
SELECT "borrowings".* FROM "borrowings" WHERE "borrowings"."user_id" = 2 AND "borrowings"."returned_at" IS NULL AND (due_date < '2026-04-12')
SELECT COUNT(*) FROM "borrowings" WHERE "borrowings"."user_id" = 2 AND "borrowings"."returned_at" IS NOT NULL
---
      def render_member_dashboard
        user_borrowings = current_user.borrowings.includes(:book, :user)

        render json: {
          status: { code: 200, message: "Member dashboard retrieved successfully." },
          data: {
            active_borrowings: user_borrowings.active.map { |b| BorrowingSerializer.new(b).serializable_hash },
            overdue_borrowings: user_borrowings.overdue.map { |b| BorrowingSerializer.new(b).serializable_hash },
            borrowing_history_count: user_borrowings.where.not(returned_at: nil).count