backend/app/controllers/users/sessions_controller.rb

SELECT 1 AS one FROM "jwt_denylist" WHERE "jwt_denylist"."jti" = '1cb487c9-c441-4044-ad5b-d14a8ae30114' LIMIT 1
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
---
  def respond_to_on_destroy
    if request.headers["Authorization"].present?
      begin
        token = request.headers["Authorization"].split(" ").last
        jwt_payload = JWT.decode(token, ENV["DEVISE_JWT_SECRET_KEY"]).first
        jti = jwt_payload["jti"]

        if JwtDenylist.exists?(jti: jti)
          current_user = nil
        else
          current_user = User.find(jwt_payload["sub"])